console.log(`1. Верстка валидная  "+10";
\n
2. Верстка семантическая   "+16"
    header, main,footer  "+2"
    min 6 section  "+2"
    только 1 заголовок h1  "+2"
    min 5 заголовков h2  "+2"
    min 1 элемент nav (в хедере)  "+2"
    min 2 списка ul > li > a  "+2"
    min 7 кпопок button  "+2"
    min 2 input  "+2"
\n
3. Вёрстка соответствует макету  "+54"
    Блок header  "+8"
    расстояние между элементами меню 30px
    элементы меню - якоря
    элементы меню интерактивны при hover
    расстояние от меню до иконки - 40px
    иконка не вхожит в nav
    текст "Brooklyn Public Library" находится в h1
\n
4. секция 'Welcome'  "+4"
\n
5. секция 'About'  "+6"
    добавлены все 5 картинок
    расстояние между кнопками пагинации 10px
    область нажатия curcor +5px в каждую сторону
\n
6. секция 'Favorites'  "+8"
    интерактивные кнопки radio+label
    область вокруг кнопки 5px
    все 4 секции (3 скрыты)
    кнопки buy интерактивны
    кнопка own - не интерактивна, есть атрибут disabled
\n
7. секция 'CoffeShop'  "+6"
\n
8. секция 'Contacts'  "+6"
    все телефоны - ссылки с типом tel
    контакт - ссылка с типом mailto
\n
9. секция 'LibraryCard'  "+8"
    форма с полями input
    ограничение на ввод только букв и цифр, а также дефиса и пробела
    кнопки интерактивные
\n
10. блок 'footer'  "+8"
    адрес в виде ссылки
    иконки соц сетей - ссылки
    username - ссылка на гитхаб
\n
11. Общие требования к верстке  "+20"
    использованы флексы  "+2"
    при уменьшении масштаба страницы браузера вся вёрстка (контент) размещается по центру  "+2"
    иконки добавлены в формате '.svg'.  "+2"
    изображения добавлены в формате или '.png'  "+2"
    есть 'favicon'  "+2"
    плавная прокрутка по якорям  "+2"
    название ссылки 'Username' заменено и ведет на GitHub студента  "+2"
    ссылка 'The Rolling Scopes School' ведет на страницу курса  "+2"
    интерактивность  "+2"
    изменение внешнего вида при интерактивности не влияет на соседние эл-ты  "+2"
\n
Общая оценка 100`);