console.log(`1. соответствует макету.  "+26";
\n
    header  "+2"
    Welcome  "+2"
    About  "+2"
    5 точек  "+2"
    Favorites  "+4"
    CoffeShop  "+4"
    Contacts  "+4"
    LibraryCard  "+4"
    footer  "+2"
\n
2. до 640px включительно нет горизонтальной полосы прокрутки  "+12"
    нет полосы прокрутки от 1440рх до 640рх  "+4"
    элементы не выходят за пределы окна браузера от 1440рх до 640рх "+4"
    элементы не наезжают друг на друга от 1440рх до 640рх "+4"
\n
3. На ширине экрана 768рх реализовано адаптивное меню "+12"
    при нажатии на бургер-иконку плавно появляется адаптивное меню  "+4"
    при нажатии на крестик, или на область вне меню, адаптивное меню плавно скрывается,  уезжая за экран "+4"
    ссылки в адаптивном меню работают, обеспечивая плавную прокрутку по якорям при нажатии, 
    а само адаптивное меню при этом плавно скрывается "+2"
    размеры открытого бургер-меню соответствуют макету "+2"
\n
Общая оценка 50`);